[
  {
    "autor": "Haik Aftandilian",
    "titulo": "Improving Firefox Stability in the Enterprise by Reducing DLL Injection",
    "resumen": "Beginning in version 138, Firefox will offer an alternative to DLL injection for Data Loss Prevention (DLP) deployments in enterprise environments. DLL Injection DLL injection into Firefox is a topic we’ve covered on the Hacks blog before. In 2023, we blogged about the Firefox capability to let users block third-party DLLs from being loaded. We […]",
    "parrafo": "No hay parrafo",
    "fecha": "2025-03-25T11:31:16-07:00",
    "url": "https://hacks.mozilla.org/2025/03/improving-firefox-stability-in-the-enterprise-by-reducing-dll-injection/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2021/10/biophoto-64x64.png"
  },
  {
    "autor": "James Graham",
    "titulo": "Launching Interop 2025",
    "resumen": "Interop 2025 continues the mission to make the web more consistent across browsers, building on 2024’s 95% interoperability score. This year, 19 focus areas target key developer needs and long-standing issues, including WebRTC improvements, Storage Access API, and CSS Zoom.",
    "parrafo": "No hay parrafo",
    "fecha": "2025-02-13T08:59:13-08:00",
    "url": "https://hacks.mozilla.org/2025/02/interop-2025/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "Mark Mayo",
    "titulo": "Introducing Uniffi for React Native: Rust-Powered Turbo Modules",
    "resumen": "Mozilla and Filament have introduced Uniffi for React Native, a tool that allows developers to leverage the safety and performance benefits of Rust in cross-platform React Native apps.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-12-04T11:38:01-08:00",
    "url": "https://hacks.mozilla.org/2024/12/introducing-uniffi-for-react-native-rust-powered-turbo-modules/",
    "imagen": "https://secure.gravatar.com/avatar/dcea6b39c498494e270e1352fd9efa38?s=64&d=mm&r=g"
  },
  {
    "autor": "Stephen Hood",
    "titulo": "Llamafile v0.8.14: a new UI, performance gains, and more",
    "resumen": "Discover the latest release of Llamafile 0.8.14, an open-source AI tool by Mozilla Builders. With a new command-line chat interface, enhanced performance, and support for powerful models, Llamafile makes it easy to run large language models (LLMs) on your own hardware. Learn more about the updates and how to get involved with this cutting-edge project.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-10-16T06:32:30-07:00",
    "url": "https://hacks.mozilla.org/2024/10/llamafile-v0-8-14-a-new-ui-performance-gains-and-more/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/10/cropped-stephen-hood-headshot-64x64.png"
  },
  {
    "autor": "Marco Figueroa",
    "titulo": "0Din: A GenAI Bug Bounty Program – Securing Tomorrow’s AI Together",
    "resumen": "As AI continues to evolve, so do the threats against it. As these GenAI systems become more sophisticated and widely adopted, ensuring their security and ethical use becomes paramount. 0Din is a groundbreaking GenAI bug bounty program dedicated specifically to help secure GenAI systems and beyond. In this blog, you'll learn about 0Din, how it works, and how you can participate and make a difference in securing our AI future.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-08-08T11:39:13-07:00",
    "url": "https://hacks.mozilla.org/2024/08/0din-a-genai-bug-bounty-program-securing-tomorrows-ai-together/",
    "imagen": "https://secure.gravatar.com/avatar/28bd0fd405165ce1f924b262aad30e49?s=64&d=mm&r=g"
  },
  {
    "autor": "James Graham",
    "titulo": "Announcing Official Puppeteer Support for Firefox",
    "resumen": "We’re pleased to announce that, as of version 23, the Puppeteer browser automation library now has first-class support for Firefox. This means that it’s now easy to write automation and perform end-to-end testing using Puppeteer, and run against both Chrome and Firefox.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-08-07T08:44:40-07:00",
    "url": "https://hacks.mozilla.org/2024/08/puppeteer-support-for-firefox/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "Christian Holler",
    "titulo": "Snapshots for IPC Fuzzing",
    "resumen": "Process separation remains one of the most important parts of the Firefox security model and securing our IPC (Inter-Process Communication) interfaces is crucial to keep privileges in the different processes separated. We take a more detailed look at our newest tool for finding vulnerabilities in these interfaces – snapshot fuzzing.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-06-27T09:18:49-07:00",
    "url": "https://hacks.mozilla.org/2024/06/snapshots-for-ipc-fuzzing/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/06/cropped-export2-small-square-64x64.jpg"
  },
  {
    "autor": "Stephen Hood",
    "titulo": "Sponsoring sqlite-vec to enable more powerful Local AI applications",
    "resumen": "Today we’re proud to announce the next Mozilla Builders project: sqlite-vec. Led by independent developer Alex Garcia, this project brings vector search functionality to the beloved SQLite embedded database. Alex has been working on this problem for a while, and we think his latest approach will have a great impact by providing application developers with a powerful new tool for building Local AI applications.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-06-25T08:25:58-07:00",
    "url": "https://hacks.mozilla.org/2024/06/sponsoring-sqlite-vec-to-enable-more-powerful-local-ai-applications/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/10/cropped-stephen-hood-headshot-64x64.png"
  },
  {
    "autor": "Tarek Ziadé",
    "titulo": "Experimenting with local alt text generation in Firefox Nightly",
    "resumen": "Firefox 130 will introduce an experimental new capability to automatically generate alt-text for images using a fully private on-device AI model. The feature will be available as part of Firefox’s built-in PDF editor, and our end goal is to make it available in general browsing for users with screen readers.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-05-31T09:43:46-07:00",
    "url": "https://hacks.mozilla.org/2024/05/experimenting-with-local-alt-text-generation-in-firefox-nightly/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/05/cropped-250019-64x64.jpg"
  },
  {
    "autor": "Stephen Hood",
    "titulo": "Llamafile’s progress, four months in",
    "resumen": "When Mozilla’s Innovation group first launched the llamafile project late last year, we were thrilled by the immediate positive response from open source AI developers. It’s become one of Mozilla’s top three most-favorited repositories on GitHub, attracting a number of contributors, some excellent PRs, and a growing community on our Discord server.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-04-25T08:34:08-07:00",
    "url": "https://hacks.mozilla.org/2024/04/llamafiles-progress-four-months-in/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/10/cropped-stephen-hood-headshot-64x64.png"
  },
  {
    "autor": "Alex Franchuk",
    "titulo": "Porting a cross-platform GUI application to Rust",
    "resumen": "In this blog post, we delve into the motivations for choosing Rust for our crash reporter, outline the unique challenges of designing an application that operates when the main browser has failed, and discuss the new architecture we've implemented. We also share insights into the technical nuances of the implementation, demonstrating how Rust's features are leveraged to handle crashes more effectively and securely.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-04-23T12:08:08-07:00",
    "url": "https://hacks.mozilla.org/2024/04/porting-a-cross-platform-gui-application-to-rust/",
    "imagen": "https://secure.gravatar.com/avatar/96d490ad54610a265a7fcc4d0ac2a3b6?s=64&d=mm&r=g"
  },
  {
    "autor": "Thomas Lodato",
    "titulo": "Prototype even faster with the Gradio UI for Figma component library",
    "resumen": "In the fast-paced world of generative AI, staying ahead means moving swiftly and smartly. That's why we've embraced Gradio, the low-code prototyping toolkit from Hugging Face, as our go-to for bringing new ideas to life.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-04-11T08:13:48-07:00",
    "url": "https://hacks.mozilla.org/2024/04/prototype-even-faster-with-the-gradio-ui-for-figma-component-library/",
    "imagen": "https://secure.gravatar.com/avatar/?s=64&d=mm&r=g"
  },
  {
    "autor": "Brian Grinstead",
    "titulo": "Improving Performance in Firefox and Across the Web with Speedometer 3",
    "resumen": "In collaboration with the other major browser engine developers, Mozilla is thrilled to announce Speedometer 3 today. Like previous versions of Speedometer, this benchmark measures what we think matters most for performance online: responsiveness. But today’s release is more open and more challenging than before, and is the best tool for driving browser performance improvements that we’ve ever seen.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-03-11T09:00:36-07:00",
    "url": "https://hacks.mozilla.org/2024/03/improving-performance-in-firefox-and-across-the-web-with-speedometer-3/",
    "imagen": "https://secure.gravatar.com/avatar/5e699d95460c943a64c4ce3e96ff24fe?s=64&d=mm&r=g"
  },
  {
    "autor": "James Graham",
    "titulo": "Announcing Interop 2024",
    "resumen": "Following the success of Interop 2023, we are pleased to confirm that the project will continue in 2024 with a new selection of focus areas, representing areas of the web platform where we think we can have the biggest positive impact on users and web developers.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-02-01T09:05:30-08:00",
    "url": "https://hacks.mozilla.org/2024/02/announcing-interop-2024/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "Serge Guelton",
    "titulo": "Option Soup: the subtle pitfalls of combining compiler flags",
    "resumen": "During the Firefox 120 beta cycle, a new crash signature appeared on our radars with significant volume. Engineers working on Firefox, explore the subtle pitfalls of combining compiler flags.",
    "parrafo": "No hay parrafo",
    "fecha": "2024-01-29T10:18:33-08:00",
    "url": "https://hacks.mozilla.org/2024/01/option-soup-the-subtle-pitfalls-of-combining-compiler-flags/",
    "imagen": "https://secure.gravatar.com/avatar/9cdfdfc05249440f57269a0d26487253?s=64&d=mm&r=g"
  },
  {
    "autor": "James Graham",
    "titulo": "Puppeteer Support for the Cross-Browser WebDriver BiDi Standard",
    "resumen": "Puppeteer now supports the next-generation, cross-browser WebDriver BiDi standard. This new protocol makes it easy for web developers to write automated tests that work across multiple browser engines.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-12-12T08:14:03-08:00",
    "url": "https://hacks.mozilla.org/2023/12/puppeteer-webdriver-bidi/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "Johan Lorenzo (Mozilla)",
    "titulo": "Firefox Developer Edition and Beta: Try out Mozilla’s .deb package!",
    "resumen": "A month ago, we introduced our Nightly package for Debian-based Linux distributions. Today, we are proud to announce we made our .deb package available for Developer Edition and Beta!",
    "parrafo": "No hay parrafo",
    "fecha": "2023-11-30T11:55:38-08:00",
    "url": "https://hacks.mozilla.org/2023/11/firefox-developer-edition-and-beta-try-out-mozillas-deb-package/",
    "imagen": "https://secure.gravatar.com/avatar/2cf8ca191d6cf9a10cc90462f9c9258d?s=64&d=mm&r=g"
  },
  {
    "autor": "Stephen Hood",
    "titulo": "Introducing llamafile",
    "resumen": "We're thrilled to announce the first release of llamafile, inviting the open source community to join this groundbreaking project. With llamafile, you can effortlessly convert large language model (LLM) weights into executables. Imagine transforming a 4GB file of LLM weights into a binary that runs smoothly on six different operating systems, without requiring installation.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-11-29T10:46:02-08:00",
    "url": "https://hacks.mozilla.org/2023/11/introducing-llamafile/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/10/cropped-stephen-hood-headshot-64x64.png"
  },
  {
    "autor": "Dan Brown",
    "titulo": "Mozilla AI Guide Launch with Summarization Code Example",
    "resumen": "Mozilla has just launched the AI Guide, a collaborative hub for developers to join forces, inspire each other, and lead the way in groundbreaking generative AI advancements. The AI Guide’s initial focus begins with language models and the aim is to become a collaborative community-driven resource covering other types of models.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-11-16T08:20:15-08:00",
    "url": "https://hacks.mozilla.org/2023/11/mozilla-ai-guide-launch-with-summarization-code-example/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2017/04/dbrown@mozilla.com_avatar_1492021420-64x64.jpg"
  },
  {
    "autor": "Bas Schouten",
    "titulo": "Down and to the Right: Firefox Got Faster for Real Users in 2023",
    "resumen": "To deliver against our vision and enable a better online experience for everyone, we’ve been working hard on making Firefox even faster. We’re extremely happy to report that this has resulted in a significant improvement in speed over the past year.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-10-31T09:29:05-07:00",
    "url": "https://hacks.mozilla.org/2023/10/down-and-to-the-right-firefox-got-faster-for-real-users-in-2023/",
    "imagen": "https://secure.gravatar.com/avatar/4e1eac71203d85974b94be13ce5ba794?s=64&d=mm&r=g"
  },
  {
    "autor": "Bobby Holley",
    "titulo": "Built for Privacy: Partnering to Deploy Oblivious HTTP and Prio in Firefox",
    "resumen": "Protecting user privacy is a core element of Mozilla’s vision for the web and the internet at large. In pursuit of this vision, we’re pleased to announce new partnerships with Fastly and Divvi Up to deploy privacy-preserving technology in Firefox.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-10-12T06:02:35-07:00",
    "url": "https://hacks.mozilla.org/2023/10/built-for-privacy-partnering-to-deploy-oblivious-http-and-prio-in-firefox/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2021/12/bholley-sketch-64x64.png"
  },
  {
    "autor": "Brian Grinstead",
    "titulo": "Faster Vue.js Execution in Firefox",
    "resumen": "Firefox performance on Vue.js has improved significantly throughout the year. Most recently, we sped up reactivity with Proxy optimizations. This change landed in Firefox 118, so it’s currently on Beta and will ride along to Release by the end of September.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-09-05T09:39:32-07:00",
    "url": "https://hacks.mozilla.org/2023/09/faster-vue-js-execution-in-firefox/",
    "imagen": "https://secure.gravatar.com/avatar/5e699d95460c943a64c4ce3e96ff24fe?s=64&d=mm&r=g"
  },
  {
    "autor": "Ben Dean-Kawamura",
    "titulo": "Autogenerating Rust-JS bindings with UniFFI",
    "resumen": "This blog post will walk through how we developed UniFFI: a Rust library for auto-generating foreign language bindings. We will walk through some of the issues that arose along the way and how we handled them.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-08-08T04:15:31-07:00",
    "url": "https://hacks.mozilla.org/2023/08/autogenerating-rust-js-bindings-with-uniffi/",
    "imagen": "https://secure.gravatar.com/avatar/2cbb1b8b2e36037911dd0b0c2f1144a5?s=64&d=mm&r=g"
  },
  {
    "autor": "Stephen Hood",
    "titulo": "So you want to build your own open source ChatGPT-style chatbot…",
    "resumen": "Artificial intelligence may well prove one of the most impactful and disruptive technologies to come along in years. We want to understand, support, and contribute to these efforts because we believe that they offer one of the best ways to help ensure that the AI systems that emerge are truly trustworthy. With this in mind, a small team within Mozilla’s innovation group recently undertook a hackathon at our headquarters in San Francisco. Our objective: build a Mozilla internal chatbot prototype.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-07-27T10:52:57-07:00",
    "url": "https://hacks.mozilla.org/2023/07/so-you-want-to-build-your-own-open-source-chatbot/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2024/10/cropped-stephen-hood-headshot-64x64.png"
  },
  {
    "autor": "Greg Stoll",
    "titulo": "Letting users block injected third-party DLLs in Firefox",
    "resumen": "In Firefox 110, users now have the ability to control which third-party DLLs are allowed to load into Firefox processes. Let’s talk about what this means and when it might be useful.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-03-30T11:41:16-07:00",
    "url": "https://hacks.mozilla.org/2023/03/letting-users-block-injected-third-party-dlls-in-firefox/",
    "imagen": "https://secure.gravatar.com/avatar/5c69d5ea204f37775f4564c418633beb?s=64&d=mm&r=g"
  },
  {
    "autor": "Dan Brown",
    "titulo": "Mozilla Launches Responsible AI Challenge",
    "resumen": "We want entrepreneurs and builders to join us in creating a future where AI is developed through this responsible lens. That’s why we are relaunching our Mozilla Builders program with the Responsible AI Challenge.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-03-14T13:42:38-07:00",
    "url": "https://hacks.mozilla.org/2023/03/mozilla-launches-responsible-ai-challenge/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2017/04/dbrown@mozilla.com_avatar_1492021420-64x64.jpg"
  },
  {
    "autor": "James Graham",
    "titulo": "Announcing Interop 2023",
    "resumen": "Interop 2022 showed significant improvements in the interoperability of multiple platform features, along with several cross-browser investigations that looked into complex, under-specified, areas of the platform where interoperability has been difficult to achieve. Building on this, we're pleased to announce Interop 2023, the next iteration of the Interop project.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-02-01T09:02:13-08:00",
    "url": "https://hacks.mozilla.org/2023/02/announcing-interop-2023/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "James Graham",
    "titulo": "Interop 2022: Outcomes",
    "resumen": "Last March we announced the Interop 2022 project, a collaboration between Apple, Bocoup, Google, Igalia, Microsoft, and Mozilla to improve the quality and consistency of their implementations of the web platform. Now that it's 2023 and we're deep into preparations for the next iteration of Interop, it's a good time to reflect on how the first year of Interop has gone.",
    "parrafo": "No hay parrafo",
    "fecha": "2023-01-31T09:04:42-08:00",
    "url": "https://hacks.mozilla.org/2023/01/interop-2022-outcomes/",
    "imagen": "https://hacks.mozilla.org/wp-content/uploads/2020/11/ravengfairy006-64x64.jpg"
  },
  {
    "autor": "Francesca Minelli",
    "titulo": "How the Mozilla Community helps shape our products",
    "resumen": "A product is first an idea, then a project, and then a prototype. Here, at Mozilla, our awesome community is there every step of the way to support and contribute to our products. None of what we do would be possible without this multicultural, multilingual community of like-minded people working together to be a better internet.",
    "parrafo": "No hay parrafo",
    "fecha": "2022-12-07T10:48:54-08:00",
    "url": "https://hacks.mozilla.org/2022/12/how-the-mozilla-community-helps-to-shape-our-products/",
    "imagen": "https://secure.gravatar.com/avatar/b2ef730f3c02d660107fc3b57e48a5b9?s=64&d=mm&r=g"
  },
  {
    "autor": "Gabriele Svelto",
    "titulo": "Improving Firefox stability with this one weird trick",
    "resumen": "We break down how we reduced Firefox out-of-memory crashes on Windows with a simple trick. Poorly behaving web pages and apps are no longer capable of crashing the browser by exhausting memory.",
    "parrafo": "No hay parrafo",
    "fecha": "2022-11-22T06:16:56-08:00",
    "url": "https://hacks.mozilla.org/2022/11/improving-firefox-stability-with-this-one-weird-trick/",
    "imagen": "https://secure.gravatar.com/avatar/03fda82227c39197ab49cd9cef4e3e89?s=64&d=mm&r=g"
  }
]